---
kind: property
id: P:Autodesk.Revit.DB.HostedSweep.Length
zh: 长度
source: html/5f5119d2-7b2f-1a17-0ba3-ef74cbe984e9.htm
---
# Autodesk.Revit.DB.HostedSweep.Length Property

**中文**: 长度

Retrieve the length of the hosted sweep object.

## Syntax (C#)
```csharp
public double Length { get; }
```